ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M451/device/StdDriver/m451_spi.c
    /* Check TX threshold interrupt flag */
    if ((u32Mask & SPI_FIFO_TXTH_INT_MASK) && (spi->STATUS & SPI_STATUS_TXTHIF_Msk)) {
        u32IntFlag |= SPI_FIFO_TXTH_INT_MASK;
    }

    /* Check RX threshold interrupt flag */
    if ((u32Mask & SPI_FIFO_RXTH_INT_MASK) && (spi->STATUS & SPI_STATUS_RXTHIF_Msk)) {
        u32IntFlag |= SPI_FIFO_RXTH_INT_MASK;
    }

    /* Check RX overrun interrupt flag */
    if ((u32Mask & SPI_FIFO_RXOV_INT_MASK) && (spi->STATUS & SPI_STATUS_RXOVIF_Msk)) {
        u32IntFlag |= SPI_FIFO_RXOV_INT_MASK;
    }

    /* Check RX time-out interrupt flag */
    if ((u32Mask & SPI_FIFO_RXTO_INT_MASK) && (spi->STATUS & SPI_STATUS_RXTOIF_Msk)) {
        u32IntFlag |= SPI_FIFO_RXTO_INT_MASK;
    }

    return u32IntFlag;
}

/**
  * @brief  Clear interrupt flag.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32Mask The combination of all related interrupt sources.
  *                     Each bit corresponds to a interrupt source.
  *                     This parameter decides which interrupt flags will be cleared. It could be the combination of:
  *                       - \ref SPI_UNIT_INT_MASK
  *                       - \ref SPI_SSACT_INT_MASK
  *                       - \ref SPI_SSINACT_INT_MASK
  *                       - \ref SPI_SLVUR_INT_MASK
  *                       - \ref SPI_SLVBE_INT_MASK
  *                       - \ref SPI_SLVTO_INT_MASK
  *                       - \ref SPI_TXUF_INT_MASK
  *                       - \ref SPI_FIFO_RXOV_INT_MASK
  *                       - \ref SPI_FIFO_RXTO_INT_MASK
  *
  * @return None
  * @details Clear SPI related interrupt flags specified by u32Mask parameter.
  */
void SPI_ClearIntFlag(SPI_T *spi, uint32_t u32Mask)
{
    if (u32Mask & SPI_UNIT_INT_MASK) {
        spi->STATUS = SPI_STATUS_UNITIF_Msk;    /* Clear unit transfer interrupt flag */
    }

    if (u32Mask & SPI_SSACT_INT_MASK) {
        spi->STATUS = SPI_STATUS_SSACTIF_Msk;    /* Clear slave selection signal active interrupt flag */
    }

    if (u32Mask & SPI_SSINACT_INT_MASK) {
        spi->STATUS = SPI_STATUS_SSINAIF_Msk;    /* Clear slave selection signal inactive interrupt flag */
    }

    if (u32Mask & SPI_SLVUR_INT_MASK) {
        spi->STATUS = SPI_STATUS_SLVURIF_Msk;    /* Clear slave TX under run interrupt flag */
    }

    if (u32Mask & SPI_SLVBE_INT_MASK) {
        spi->STATUS = SPI_STATUS_SLVBEIF_Msk;    /* Clear slave bit count error interrupt flag */
    }

    if (u32Mask & SPI_SLVTO_INT_MASK) {
        spi->STATUS = SPI_STATUS_SLVTOIF_Msk;    /* Clear slave time-out interrupt flag */
    }

    if (u32Mask & SPI_TXUF_INT_MASK) {
        spi->STATUS = SPI_STATUS_TXUFIF_Msk;    /* Clear slave TX underflow interrupt flag */
    }

    if (u32Mask & SPI_FIFO_RXOV_INT_MASK) {
        spi->STATUS = SPI_STATUS_RXOVIF_Msk;    /* Clear RX overrun interrupt flag */
    }

    if (u32Mask & SPI_FIFO_RXTO_INT_MASK) {
        spi->STATUS = SPI_STATUS_RXTOIF_Msk;    /* Clear RX time-out interrupt flag */
    }
}

/**
  * @brief  Get SPI status.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32Mask The combination of all related sources.
  *                     Each bit corresponds to a source.
  *                     This parameter decides which flags will be read. It is combination of:
  *                       - \ref SPI_BUSY_MASK
  *                       - \ref SPI_RX_EMPTY_MASK
  *                       - \ref SPI_RX_FULL_MASK
  *                       - \ref SPI_TX_EMPTY_MASK
  *                       - \ref SPI_TX_FULL_MASK
  *                       - \ref SPI_TXRX_RESET_MASK
  *                       - \ref SPI_SPIEN_STS_MASK
  *                       - \ref SPI_SSLINE_STS_MASK
  *
  * @return Flags of selected sources.
  * @details Get SPI related status specified by u32Mask parameter.
  */
uint32_t SPI_GetStatus(SPI_T *spi, uint32_t u32Mask)
{
    uint32_t u32Flag = 0;

    /* Check busy status */
    if ((u32Mask & SPI_BUSY_MASK) && (spi->STATUS & SPI_STATUS_BUSY_Msk)) {
        u32Flag |= SPI_BUSY_MASK;
    }

    /* Check RX empty flag */
    if ((u32Mask & SPI_RX_EMPTY_MASK) && (spi->STATUS & SPI_STATUS_RXEMPTY_Msk)) {
        u32Flag |= SPI_RX_EMPTY_MASK;
    }

    /* Check RX full flag */
    if ((u32Mask & SPI_RX_FULL_MASK) && (spi->STATUS & SPI_STATUS_RXFULL_Msk)) {
        u32Flag |= SPI_RX_FULL_MASK;
    }

    /* Check TX empty flag */
    if ((u32Mask & SPI_TX_EMPTY_MASK) && (spi->STATUS & SPI_STATUS_TXEMPTY_Msk)) {
        u32Flag |= SPI_TX_EMPTY_MASK;
    }

    /* Check TX full flag */
    if ((u32Mask & SPI_TX_FULL_MASK) && (spi->STATUS & SPI_STATUS_TXFULL_Msk)) {
        u32Flag |= SPI_TX_FULL_MASK;
    }

    /* Check TX/RX reset flag */
    if ((u32Mask & SPI_TXRX_RESET_MASK) && (spi->STATUS & SPI_STATUS_TXRXRST_Msk)) {
        u32Flag |= SPI_TXRX_RESET_MASK;
    }

    /* Check SPIEN flag */
    if ((u32Mask & SPI_SPIEN_STS_MASK) && (spi->STATUS & SPI_STATUS_SPIENSTS_Msk)) {
        u32Flag |= SPI_SPIEN_STS_MASK;
    }

    /* Check SPIn_SS line status */
    if ((u32Mask & SPI_SSLINE_STS_MASK) && (spi->STATUS & SPI_STATUS_SSLINE_Msk)) {
        u32Flag |= SPI_SSLINE_STS_MASK;
    }

    return u32Flag;
}


/**
  * @brief  This function is used to get I2S source clock frequency.
  * @param[in]  i2s The pointer of the specified I2S module.
  * @return I2S source clock frequency (Hz).
  * @details Return the source clock frequency according to the setting of SPI1SEL (CLKSEL2[5:4]) or SPI2SEL (CLKSEL2[7:6]).
  * @note   Only SPI1 and SPI2 support I2S mode.
  */
static uint32_t I2S_GetSourceClockFreq(SPI_T *i2s)
{
    uint32_t u32Freq, u32HCLKFreq;

    if (i2s == SPI1) {
        if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI1SEL_Msk) == CLK_CLKSEL2_SPI1SEL_HXT) {
            u32Freq = __HXT;    /* Clock source is HXT */
        } else if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI1SEL_Msk) == CLK_CLKSEL2_SPI1SEL_PLL) {
            u32Freq = CLK_GetPLLClockFreq();    /* Clock source is PLL */
        } else if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI1SEL_Msk) == CLK_CLKSEL2_SPI1SEL_PCLK1) {
            /* Get system clock frequency */
            u32HCLKFreq = CLK_GetHCLKFreq();
            /* Clock source is PCLK1 */
            if ((CLK->CLKSEL0 & CLK_CLKSEL0_PCLK1SEL_Msk) == CLK_CLKSEL0_PCLK1SEL_HCLK_DIV2) {
                u32Freq = (u32HCLKFreq / 2);
            } else {
                u32Freq = u32HCLKFreq;
            }
        } else {
            u32Freq = __HIRC;    /* Clock source is HIRC */
        }
    } else {
        if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI2SEL_Msk) == CLK_CLKSEL2_SPI2SEL_HXT) {
            u32Freq = __HXT;    /* Clock source is HXT */
        } else if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI2SEL_Msk) == CLK_CLKSEL2_SPI2SEL_PLL) {
            u32Freq = CLK_GetPLLClockFreq();    /* Clock source is PLL */
        } else if ((CLK->CLKSEL2 & CLK_CLKSEL2_SPI2SEL_Msk) == CLK_CLKSEL2_SPI2SEL_PCLK0) {
            /* Get system clock frequency */
            u32HCLKFreq = CLK_GetHCLKFreq();
            /* Clock source is PCLK0 */
            if ((CLK->CLKSEL0 & CLK_CLKSEL0_PCLK0SEL_Msk) == CLK_CLKSEL0_PCLK0SEL_HCLK_DIV2) {
                u32Freq = (u32HCLKFreq / 2);
            } else {
                u32Freq = u32HCLKFreq;
            }
        } else {
            u32Freq = __HIRC;    /* Clock source is HIRC */
        }
    }

    return u32Freq;
}

/**
  * @brief  This function configures some parameters of I2S interface for general purpose use.
  * @param[in] i2s The pointer of the specified I2S module.
  * @param[in] u32MasterSlave I2S operation mode. Valid values are listed below.
  *                                     - \ref I2S_MODE_MASTER
  *                                     - \ref I2S_MODE_SLAVE
  * @param[in] u32SampleRate Sample rate
  * @param[in] u32WordWidth Data length. Valid values are listed below.
  *                                     - \ref I2S_DATABIT_8
  *                                     - \ref I2S_DATABIT_16
  *                                     - \ref I2S_DATABIT_24
  *                                     - \ref I2S_DATABIT_32
  * @param[in] u32Channels Audio format. Valid values are listed below.
  *                                     - \ref I2S_MONO
  *                                     - \ref I2S_STEREO
  * @param[in] u32DataFormat Data format. Valid values are listed below.
  *                                     - \ref I2S_FORMAT_I2S
  *                                     - \ref I2S_FORMAT_MSB
  *                                     - \ref I2S_FORMAT_PCMA
  *                                     - \ref I2S_FORMAT_PCMB
  * @return Real sample rate of master mode or peripheral clock rate of slave mode.
  * @details This function will reset SPI/I2S controller and configure I2S controller according to the input parameters.
  *          Set TX and RX FIFO threshold to middle value. Both the TX and RX functions will be enabled.
  *          The actual sample rate may be different from the target sample rate. The real sample rate will be returned for reference.
  * @note   Only SPI1 and SPI2 support I2S mode.
  * @note   In slave mode, the SPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t I2S_Open(SPI_T *i2s, uint32_t u32MasterSlave, uint32_t u32SampleRate, uint32_t u32WordWidth, uint32_t u32Channels, uint32_t u32DataFormat)
{
    uint32_t u32Divider;
    uint32_t u32BitRate, u32SrcClk;
    uint32_t u32HCLKFreq;

    /* Reset SPI/I2S */
    if (i2s == SPI1) {
        SYS->IPRST1 |= SYS_IPRST1_SPI1RST_Msk;
        SYS->IPRST1 &= ~SYS_IPRST1_SPI1RST_Msk;
    } else {
        SYS->IPRST1 |= SYS_IPRST1_SPI2RST_Msk;
        SYS->IPRST1 &= ~SYS_IPRST1_SPI2RST_Msk;
    }

